"""
Задание №1

Поработайте с переменными:
- создайте несколько
- выведите на экран
- запросите у пользователя несколько чисел и строк и сохраните в переменные
- выведите на экран
"""

name = "Анастасия"
age = 15
print(name)
print(age)
name = input("Напишите ваше имя >>> ")
age = input("Укажите сколько вам лет >>> ")
print(f"Меня зовут {name}. Возраст {age}")
